In [1]:
import pandas as pd
import numpy as np
import collections

### Series

In [3]:
y=pd.Series([1,2,3,4])
print(y.index)
print(y)
x=pd.Series(data=[1,2,3,4],index=['a','b','c','d'])
print(type(x))
print(x.index)
print(x)
data=dict(collections.Counter("Ermias"))
z=pd.Series(data,index=['ermias','a','e','m','i'])
print(z)
print(x+y)

RangeIndex(start=0, stop=4, step=1)
0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.core.series.Series'>
Index(['a', 'b', 'c', 'd'], dtype='object')
a    1
b    2
c    3
d    4
dtype: int64
ermias    NaN
a         1.0
e         NaN
m         1.0
i         1.0
dtype: float64
a   NaN
b   NaN
c   NaN
d   NaN
0   NaN
1   NaN
2   NaN
3   NaN
dtype: float64

###  series indexing

In [24]:
print(x['a'])
print(x[['a','b']])

1
a    1
b    2
dtype: int64

In [25]:
print(x>2)
x[x>2]

a    False
b    False
c     True
d     True
dtype: bool

c    3
d    4
dtype: int64

In [7]:
np.exp(x)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [8]:
data=pd.Series([1,2,3,4],['a','b','c','d'])
frame=pd.DataFrame(data,columns=['number'])
frame

   number
a       1
b       2
c       3
d       4

### DataFrames

In [26]:
# DataFrame creation
data={'Name':["Ermias","Debebe","Inda"],"R/nship":["son","Father","Mother"]}
data=[{'a':2*i,'b':i} for i in range(3)]
print(data)
pd.DataFrame(data,index=[1,2,3])

[{'a': 0, 'b': 0}, {'a': 2, 'b': 1}, {'a': 4, 'b': 2}]

   a  b
1  0  0
2  2  1
3  4  2

In [27]:
data={'Name':["Ermias","Debebe","Inda"],"R/nship":["son","Father","Mother"]}
pd.DataFrame(data,index=[1,2,3])

     Name R/nship
1  Ermias     son
2  Debebe  Father
3    Inda  Mother

In [28]:
data=pd.Series([1,2,3,4],['a','b','c','d'])
pd.DataFrame(data,columns=["Number"])

   Number
a       1
b       2
c       3
d       4

In [29]:
pd.DataFrame({"Numbers":data})

   Numbers
a        1
b        2
c        3
d        4

In [30]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}
area=pd.Series(area_dict)
population_dict={'California': 38332521, 'Texas': 19552860, 'New York':12882135 ,
'Florida': 19651127, 'Illinois': 26448193}
population=pd.Series(population_dict)

states=pd.DataFrame({'population':population,'area':area})
states

            population    area
California    38332521  423967
Texas         19552860  695662
New York      12882135  141297
Florida       19651127  170312
Illinois      26448193  149995

In [31]:
data=[list(population_dict.values()),list(area_dict.values())]
print(data)
data=np.array(data).transpose()
print(data)
states=pd.DataFrame(data,index=['California',"Texas",'New York','Floriada','Illionois'],columns=["Population",'Area'])
states

[[38332521, 19552860, 12882135, 19651127, 26448193], [423967, 695662, 141297, 170312, 149995]]
[[38332521   423967]
 [19552860   695662]
 [12882135   141297]
 [19651127   170312]
 [26448193   149995]]

            Population    Area
California    38332521  423967
Texas         19552860  695662
New York      12882135  141297
Floriada      19651127  170312
Illionois     26448193  149995

In [32]:
pd.DataFrame(np.random.randn(3,2),columns=['Foo','Bar'],index=['a','b','c'])

        Foo       Bar
a  0.617766  0.610044
b -0.546199 -1.464476
c  0.565403 -1.732017

In [33]:
states['population density']=states['Population']/states['Area']
print(type(states["Population"]))
states["Population"]

<class 'pandas.core.series.Series'>

California    38332521
Texas         19552860
New York      12882135
Floriada      19651127
Illionois     26448193
Name: Population, dtype: int32

In [19]:
states

            Population    Area  population density
California    38332521  423967           90.413926
Texas         19552860  695662           28.106839
New York      12882135  141297           91.170619
Floriada      19651127  170312          115.383103
Illionois     26448193  149995          176.327164

In [20]:
states.head()

            Population    Area  population density
California    38332521  423967           90.413926
Texas         19552860  695662           28.106839
New York      12882135  141297           91.170619
Floriada      19651127  170312          115.383103
Illionois     26448193  149995          176.327164

In [22]:
y=pd.Series([1,2,3,4],index=[1,2,3,4])
states["y"]=y
states.drop('y',axis=1,inplace=True)
print(states["Area"][1])
states

695662

            Population    Area  population density
California    38332521  423967           90.413926
Texas         19552860  695662           28.106839
New York      12882135  141297           91.170619
Floriada      19651127  170312          115.383103
Illionois     26448193  149995          176.327164

In [23]:
states.values

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [1.95528600e+07, 6.95662000e+05, 2.81068392e+01],
       [1.28821350e+07, 1.41297000e+05, 9.11706193e+01],
       [1.96511270e+07, 1.70312000e+05, 1.15383103e+02],
       [2.64481930e+07, 1.49995000e+05, 1.76327164e+02]])

###  Index Object

In [32]:
print(states.index)
print(states.index[1])
states.columns

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')
Texas

Index(['population', 'area', 'population density', 'y'], dtype='object')

In [34]:
labels=pd.Index([1,2,3,4])
obj3=pd.Series(['a','b','c','d'],labels)
obj3.index is labels

True

# indexing and selection

In [141]:
obj4=pd.Series(['a','b','c','d'],['a','b','c','d'])
frame2=pd.DataFrame({'integer':obj,'string':obj4})
print(frame2.loc['a':'c','integer'])
frame2

a   NaN
b   NaN
c   NaN
Name: integer, dtype: float64

   integer string
0      1.0    NaN
2      2.0    NaN
4      3.0    NaN
a      NaN      a
b      NaN      b
c      NaN      c
d      NaN      d

In [147]:
print(frame2['integer']>3)
print(frame2[frame2['integer']>2])
print(frame2[(frame2['integer']>2)&(frame2['string']!='a')])

0    False
2    False
4    False
a    False
b    False
c    False
d    False
Name: integer, dtype: bool
   integer string
4      3.0    NaN
   integer string
4      3.0    NaN

### Reindex

In [123]:
obj=pd.Series([4.5,7.2,-5.3,3.6],['a','b','c','d'])
obj

a    4.5
b    7.2
c   -5.3
d    3.6
dtype: float64

In [124]:
obj2=obj.reindex(['b','a','c','d','e'])
obj2

b    7.2
a    4.5
c   -5.3
d    3.6
e    NaN
dtype: float64

In [129]:
obj=pd.Series([1,2,3],[0,2,4])
print(obj)
obj.reindex(range(6),method="ffill")

0    1
2    2
4    3
dtype: int64

0    1
1    1
2    2
3    2
4    3
5    3
dtype: int64

In [131]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=range(1,4),columns=["Ohio","Texas","California"])

print(frame.reindex(range(0,3),method='bfill'))
frame

   Ohio  Texas  California
0     0      1           2
1     0      1           2
2     3      4           5

   Ohio  Texas  California
1     0      1           2
2     3      4           5
3     6      7           8

In [39]:
frame.reindex(columns=["Ohio","Utah","California"])

   Ohio  Utah  California
1     0   NaN           2
2     3   NaN           5
3     6   NaN           8

In [150]:
frame

   Ohio  Texas  California
0     0      1           2
1     3      4           5
2     6      7           8

In [151]:
frame[frame['Texas']>4]

   Ohio  Texas  California
2     6      7           8

In [157]:
frame.reset_index(inplace=True)

In [153]:
frame['index']=range(1,4)

In [154]:
frame.set_index('index',inplace=True)

In [158]:
frame

   index  Ohio  Texas  California
0      1     0      1           2
1      2     3      4           5
2      3     6      7           8

In [82]:
frame['Ohio']

index
1    0
2    3
3    6
Name: Ohio, dtype: int32

In [159]:
frame.drop('index',axis=1,inplace=True)

In [2]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

C:\ProgramData\Anaconda3\lib\site-packages\pandas_datareader\compat\__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

In [3]:
all_data

{'AAPL':                   High         Low        Open       Close      Volume  \
 Date
 2015-05-26  132.910004  129.119995  132.600006  129.619995  70697600.0
 2015-05-27  132.259995  130.050003  130.339996  132.039993  45833200.0
 2015-05-28  131.949997  131.100006  131.860001  131.779999  30733300.0
 2015-05-29  131.449997  129.899994  131.229996  130.279999  50884500.0
 2015-06-01  131.389999  130.050003  130.279999  130.539993  32112800.0
 ...                ...         ...         ...         ...         ...
 2020-05-14  309.790009  301.529999  304.510010  309.540009  39732300.0
 2020-05-15  307.899994  300.209991  300.350006  307.709991  41587100.0
 2020-05-18  316.500000  310.320007  313.170013  314.959991  33843100.0
 2020-05-19  318.519989  313.010010  315.029999  313.140015  25432400.0
 2020-05-20  319.519989  316.519989  316.679993  319.230011  27848000.0

              Adj Close
 Date
 2015-05-26  119.458923
 2015-05-27  121.689232
 2015-05-28  121.449577
 2015-05-29  120.067184
 2015-06-01  120.306801
 ...                ...
 2020-05-14  309.540009
 2020-05-15  307.709991
 2020-05-18  314.959991
 2020-05-19  313.140015
 2020-05-20  319.230011

 [1257 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2015-05-26  172.119995  169.130005  172.110001  170.130005  3854200.0
 2015-05-27  172.479996  170.490005  171.160004  172.000000  2764400.0
 2015-05-28  171.839996  170.660004  171.449997  171.710007  1731400.0
 2015-05-29  171.350006  169.649994  171.350006  169.649994  4092000.0
 2015-06-01  171.039993  169.029999  170.210007  170.179993  2985500.0
 ...                ...         ...         ...         ...        ...
 2020-05-14  117.089996  111.809998  114.570000  116.949997  5259400.0
 2020-05-15  117.389999  115.250000  115.930000  116.980003  4786300.0
 2020-05-18  122.360001  119.750000  119.879997  121.559998  4207600.0
 2020-05-19  122.169998  120.139999  121.190002  120.290001  3241100.0
 2020-05-20  122.470001  120.599998  120.930000  121.379997  3840700.0

              Adj Close
 Date
 2015-05-26  136.887711
 2015-05-27  138.392303
 2015-05-28  138.158981
 2015-05-29  136.501480
 2015-06-01  136.927917
 ...                ...
 2020-05-14  116.949997
 2020-05-15  116.980003
 2020-05-18  121.559998
 2020-05-19  120.290001
 2020-05-20  121.379997

 [1257 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2015-05-26   46.880001   46.189999   46.830002   46.590000  29581900.0
 2015-05-27   47.770000   46.619999   46.820000   47.610001  27335600.0
 2015-05-28   48.020000   47.389999   47.500000   47.450001  19283700.0
 2015-05-29   47.570000   46.590000   47.430000   46.860001  36519600.0
 2015-06-01   47.770000   46.619999   47.060001   47.230000  28837300.0
 ...                ...         ...         ...         ...         ...
 2020-05-14  180.690002  175.679993  177.539993  180.529999  41873900.0
 2020-05-15  187.059998  177.000000  179.059998  183.160004  46610400.0
 2020-05-18  186.199997  183.960007  185.750000  184.910004  35306600.0
 2020-05-19  186.600006  183.490005  185.029999  183.630005  26799100.0
 2020-05-20  185.850006  183.940002  184.809998  185.660004  31230600.0

              Adj Close
 Date
 2015-05-26   42.165077
 2015-05-27   43.088200
 2015-05-28   42.943398
 2015-05-29   42.409435
 2015-06-01   42.744289
 ...                ...
 2020-05-14  180.028610
 2020-05-15  182.651306
 2020-05-18  184.396439
 2020-05-19  183.119995
 2020-05-20  185.660004

 [1257 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2015-05-26   539.000000   529.880005   538.119995   532.320007  2406500
 2015-05-27   540.549988   531.710022   532.799988   539.789978  1525000
 2015-05-28   540.609985   536.250000   538.010010   539.780029  1029800
 2015-05-29   538.630005   531.450012   537.369995   532.109985  2597400
 2015-06-01   536.789978   529.760010   536.789978   533.989990  1904300
 ...                 ...          ...          ...          ...      ...
 2020-05-14  1357.420044  1323.910034  1335.020020  1356.130005  1603100
 2020-05-15  1374.479980  1339.000000  1350.000000  1373.189941  1707700
 2020-05-18  1392.324951  1354.250000  1361.750000  1383.939941  1824000
 2020-05-19  1392.000000  1373.484985  1386.996948  1373.484985  1280600
 2020-05-20  1410.420044  1387.250000  1389.579956  1406.719971  1654200

               Adj Close
 Date
 2015-05-26   532.320007
 2015-05-27   539.789978
 2015-05-28   539.780029
 2015-05-29   532.109985
 2015-06-01   533.989990
 ...                 ...
 2020-05-14  1356.130005
 2020-05-15  1373.189941
 2020-05-18  1383.939941
 2020-05-19  1373.484985
 2020-05-20  1406.719971

 [1257 rows x 6 columns]}

In [6]:
price = pd.DataFrame({ticker: data['Adj Close']
for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
for ticker, data in all_data.items()})

In [7]:
returns = price.pct_change()

In [9]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-05-14  0.006143  0.010542  0.004339  0.005040
2020-05-15 -0.005912  0.000257  0.014568  0.012580
2020-05-18  0.023561  0.039152  0.009554  0.007828
2020-05-19 -0.005778 -0.010447 -0.006922 -0.007554
2020-05-20  0.019448  0.009061  0.013871  0.024198

In [10]:
returns['AAPL'].corr(returns['IBM'])

0.5337974456678505

In [11]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.533797  0.711399  0.642622
IBM   0.533797  1.000000  0.599872  0.529770
MSFT  0.711399  0.599872  1.000000  0.751452
GOOG  0.642622  0.529770  0.751452  1.000000

In [12]:
returns.corrwith(returns['IBM'])

AAPL    0.533797
IBM     1.000000
MSFT    0.599872
GOOG    0.529770
dtype: float64